**Easy**
Создайте класс, который принимает список чисел в качестве аргумента.

Добавьте методы:
1.	Поиск минимума – возвращает наименьшее число в списке.
2.	Поиск максимума – возвращает наибольшее число в списке.
3.	Сортировка по возрастанию – возвращает новый список с числами от меньшего к большему.
4.	Сортировка по убыванию – возвращает новый список с числами от большего к меньшему.
5.	Поиск элемента – проверяет, есть ли заданное число в списке.
6.	Фильтр элементов – возвращает новый список, содержащий только числа больше заданного значения.
7.	Сумма всех чисел – возвращает сумму всех элементов списка.

**Medium**
Напишите программу, которая читает текст из файла, находит в нём все уникальные слова и считает, сколько раз каждое из них встречается.
Для этого используйте HashSet, чтобы хранить только уникальные слова, и HashMap<String, Integer>, чтобы подсчитать частоту их появления.

**Hard**
Создайте класс SafeList, который:
Реализует интерфейс List<T>. 
Не позволяет добавлять null и дубликаты.
При обращении к несуществующему индексу возвращает null, а не выбрасывает ошибку. 
Все методы должны работать без выброса ошибок.
пример:
SafeList<String> list = new SafeList<>();
list.add("apple");
list.add("banana");
list.add(null);       // Не добавляется
list.add("apple");    // Не добавляется

System.out.println(list.get(0));  // apple
System.out.println(list.get(5));  // null (не ошибка!)